<?xml version="1.0" ?>
<net batch="1" name="gan_digits" version="6">
	<layers>
		<layer id="0" name="dense_9_input" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>100</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="dense_9" precision="FP32" type="FullyConnected">
			<data out-size="256.0"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>100</dim>
					<dim>256</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="102400"/>
				<biases offset="102400" size="1024"/>
			</blobs>
		</layer>
		<layer id="2" name="leaky_re_lu_7" precision="FP32" type="ReLU">
			<data negative_slope="0.20000000298023224"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>100</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="dense_10" precision="FP32" type="FullyConnected">
			<data out-size="512.0"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>100</dim>
					<dim>512</dim>
				</port>
			</output>
			<blobs>
				<weights offset="103424" size="524288"/>
				<biases offset="627712" size="2048"/>
			</blobs>
		</layer>
		<layer id="4" name="leaky_re_lu_8" precision="FP32" type="ReLU">
			<data negative_slope="0.20000000298023224"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>100</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="dense_11" precision="FP32" type="FullyConnected">
			<data out-size="1024.0"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>100</dim>
					<dim>1024</dim>
				</port>
			</output>
			<blobs>
				<weights offset="629760" size="2097152"/>
				<biases offset="2726912" size="4096"/>
			</blobs>
		</layer>
		<layer id="6" name="leaky_re_lu_9" precision="FP32" type="ReLU">
			<data negative_slope="0.20000000298023224"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>100</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="dense_12" precision="FP32" type="FullyConnected">
			<data out-size="784.0"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>100</dim>
					<dim>784</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2731008" size="3211264"/>
				<biases offset="5942272" size="3136"/>
			</blobs>
		</layer>
		<layer id="8" name="Tanh" precision="FP32" type="Activation">
			<data type="tanh"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>784</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>100</dim>
					<dim>784</dim>
				</port>
			</output>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0"/>
		<edge from-layer="1" from-port="3" to-layer="2" to-port="0"/>
		<edge from-layer="2" from-port="1" to-layer="3" to-port="0"/>
		<edge from-layer="3" from-port="3" to-layer="4" to-port="0"/>
		<edge from-layer="4" from-port="1" to-layer="5" to-port="0"/>
		<edge from-layer="5" from-port="3" to-layer="6" to-port="0"/>
		<edge from-layer="6" from-port="1" to-layer="7" to-port="0"/>
		<edge from-layer="7" from-port="3" to-layer="8" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="2019.3.0-408-gac8584cb7"/>
		<cli_parameters>
			<blobs_as_inputs value="False"/>
			<caffe_parser_path value="DIR"/>
			<data_type value="float"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_omitting_optional value="False"/>
			<disable_resnet_optimization value="False"/>
			<enable_concat_optimization value="False"/>
			<enable_flattening_nested_params value="False"/>
			<enable_ssd_gluoncv value="False"/>
			<extensions value="DIR"/>
			<framework value="onnx"/>
			<freeze_placeholder_with_value value="{}"/>
			<generate_experimental_IR_V10 value="False"/>
			<input_model value="DIR\gan_digits.onnx"/>
			<input_model_is_text value="False"/>
			<input_shape value="[100,100]"/>
			<k value="DIR\CustomLayersMapping.xml"/>
			<keep_quantize_ops_in_IR value="False"/>
			<keep_shape_ops value="False"/>
			<legacy_mxnet_model value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<move_to_preprocess value="False"/>
			<output_dir value="DIR"/>
			<placeholder_shapes value="[100 100]"/>
			<remove_memory value="False"/>
			<remove_output_softmax value="False"/>
			<reverse_input_channels value="False"/>
			<save_params_from_nd value="False"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<steps value="False"/>
			<version value="False"/>
			<unset unset_cli_parameters="batch, counts, disable_fusing, disable_gfusing, finegrain_fusing, generate_deprecated_IR_V2, input, input_checkpoint, input_meta_graph, input_proto, input_symbol, mean_file, mean_file_offsets, model_name, nd_prefix_name, output, pretrained_model_name, saved_model_dir, saved_model_tags, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_operation_patterns, tensorflow_subgraph_patterns, tensorflow_use_custom_operations_config"/>
		</cli_parameters>
	</meta_data>
</net>
