<?xml version="1.0" ?>
<net name="gan_digits" version="10">
	<layers>
		<layer id="0" name="dense_9_input" type="Parameter" version="opset1">
			<data element_type="f32" shape="100,100"/>
			<output>
				<port id="0" precision="FP32">
					<dim>100</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="dense_9/1_port_transpose420_const" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="256,100" size="102400"/>
			<output>
				<port id="1" precision="FP32">
					<dim>256</dim>
					<dim>100</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="dense_9" type="MatMul" version="opset1">
			<data transpose_a="False" transpose_b="True"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>100</dim>
				</port>
				<port id="1">
					<dim>256</dim>
					<dim>100</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>100</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="onnx_initializer_node_dense_9/bias:0/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="102400" shape="1,256" size="1024"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Add3" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>100</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="leaky_re_lu_7450/Cast_1619_const" type="Const" version="opset1">
			<data element_type="f32" offset="103424" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="leaky_re_lu_7450" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>100</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="dense_10/1_port_transpose424_const" type="Const" version="opset1">
			<data element_type="f32" offset="103428" shape="512,256" size="524288"/>
			<output>
				<port id="1" precision="FP32">
					<dim>512</dim>
					<dim>256</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="dense_10" type="MatMul" version="opset1">
			<data transpose_a="False" transpose_b="True"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>256</dim>
				</port>
				<port id="1">
					<dim>512</dim>
					<dim>256</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>100</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="onnx_initializer_node_dense_10/bias:0/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="627716" shape="1,512" size="2048"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Add2" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>100</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="leaky_re_lu_8458/Cast_1621_const" type="Const" version="opset1">
			<data element_type="f32" offset="103424" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="leaky_re_lu_8458" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>100</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="dense_11/1_port_transpose432_const" type="Const" version="opset1">
			<data element_type="f32" offset="629764" shape="1024,512" size="2097152"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>512</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="dense_11" type="MatMul" version="opset1">
			<data transpose_a="False" transpose_b="True"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>512</dim>
				</port>
				<port id="1">
					<dim>1024</dim>
					<dim>512</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>100</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="onnx_initializer_node_dense_11/bias:0/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="2726916" shape="1,1024" size="4096"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Add1" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>1024</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>100</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="leaky_re_lu_9454/Cast_1617_const" type="Const" version="opset1">
			<data element_type="f32" offset="103424" shape="1" size="4"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="leaky_re_lu_9454" type="PReLU" version="opset1">
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>1024</dim>
				</port>
				<port id="1">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>100</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="dense_12/1_port_transpose428_const" type="Const" version="opset1">
			<data element_type="f32" offset="2731012" shape="784,1024" size="3211264"/>
			<output>
				<port id="1" precision="FP32">
					<dim>784</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="dense_12" type="MatMul" version="opset1">
			<data transpose_a="False" transpose_b="True"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>1024</dim>
				</port>
				<port id="1">
					<dim>784</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>100</dim>
					<dim>784</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="onnx_initializer_node_dense_12/bias:0/Output_0/Data_/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="5942276" shape="1,784" size="3136"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>784</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>784</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>784</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>100</dim>
					<dim>784</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Tanh" type="Tanh" version="opset1">
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>784</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>100</dim>
					<dim>784</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Identity5/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>784</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="0"/>
		<edge from-layer="1" from-port="1" to-layer="2" to-port="1"/>
		<edge from-layer="2" from-port="2" to-layer="4" to-port="0"/>
		<edge from-layer="3" from-port="1" to-layer="4" to-port="1"/>
		<edge from-layer="4" from-port="2" to-layer="6" to-port="0"/>
		<edge from-layer="5" from-port="1" to-layer="6" to-port="1"/>
		<edge from-layer="6" from-port="2" to-layer="8" to-port="0"/>
		<edge from-layer="7" from-port="1" to-layer="8" to-port="1"/>
		<edge from-layer="8" from-port="2" to-layer="10" to-port="0"/>
		<edge from-layer="9" from-port="1" to-layer="10" to-port="1"/>
		<edge from-layer="10" from-port="2" to-layer="12" to-port="0"/>
		<edge from-layer="11" from-port="1" to-layer="12" to-port="1"/>
		<edge from-layer="12" from-port="2" to-layer="14" to-port="0"/>
		<edge from-layer="13" from-port="1" to-layer="14" to-port="1"/>
		<edge from-layer="14" from-port="2" to-layer="16" to-port="0"/>
		<edge from-layer="15" from-port="1" to-layer="16" to-port="1"/>
		<edge from-layer="16" from-port="2" to-layer="18" to-port="0"/>
		<edge from-layer="17" from-port="1" to-layer="18" to-port="1"/>
		<edge from-layer="18" from-port="2" to-layer="20" to-port="0"/>
		<edge from-layer="19" from-port="1" to-layer="20" to-port="1"/>
		<edge from-layer="20" from-port="2" to-layer="22" to-port="0"/>
		<edge from-layer="21" from-port="1" to-layer="22" to-port="1"/>
		<edge from-layer="22" from-port="2" to-layer="23" to-port="0"/>
		<edge from-layer="23" from-port="1" to-layer="24" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="2020.1.0-61-gd349c3ba4a"/>
		<cli_parameters>
			<blobs_as_inputs value="True"/>
			<caffe_parser_path value="DIR"/>
			<data_type value="float"/>
			<disable_nhwc_to_nchw value="False"/>
			<disable_omitting_optional value="False"/>
			<disable_resnet_optimization value="False"/>
			<enable_concat_optimization value="False"/>
			<enable_flattening_nested_params value="False"/>
			<enable_ssd_gluoncv value="False"/>
			<extensions value="DIR"/>
			<framework value="onnx"/>
			<freeze_placeholder_with_value value="{}"/>
			<generate_deprecated_IR_V2 value="False"/>
			<generate_deprecated_IR_V7 value="False"/>
			<generate_experimental_IR_V10 value="True"/>
			<input_model value="DIR\gan_digits.onnx"/>
			<input_model_is_text value="False"/>
			<input_shape value="[100,100]"/>
			<k value="DIR\CustomLayersMapping.xml"/>
			<keep_quantize_ops_in_IR value="True"/>
			<keep_shape_ops value="False"/>
			<legacy_mxnet_model value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<model_name value="gan_digits"/>
			<move_to_preprocess value="False"/>
			<output_dir value="DIR"/>
			<placeholder_data_types value="{}"/>
			<placeholder_shapes value="[100 100]"/>
			<progress value="False"/>
			<remove_memory value="False"/>
			<remove_output_softmax value="False"/>
			<reverse_input_channels value="False"/>
			<save_params_from_nd value="False"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<stream_output value="False"/>
			<unset unset_cli_parameters="batch, counts, disable_fusing, disable_gfusing, finegrain_fusing, input, input_checkpoint, input_meta_graph, input_proto, input_symbol, mean_file, mean_file_offsets, nd_prefix_name, output, pretrained_model_name, saved_model_dir, saved_model_tags, scale, tensorboard_logdir, tensorflow_custom_layer_libraries, tensorflow_custom_operations_config_update, tensorflow_object_detection_api_pipeline_config, tensorflow_operation_patterns, tensorflow_subgraph_patterns, tensorflow_use_custom_operations_config, transformations_config"/>
		</cli_parameters>
	</meta_data>
</net>
